Revit 2027 API
BuiltInFailures.GroupFailures.ProblemRegeneratingInGroupUpdate Property
 Unable to regenerate while updating groups at end of transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProblemRegeneratingInGroupUpdate { get; }
Public Shared ReadOnly Property ProblemRegeneratingInGroupUpdate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProblemRegeneratingInGroupUpdate {
	FailureDefinitionId^ get ();
}
static member ProblemRegeneratingInGroupUpdate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace